tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jesseduffield/lazygit"
brew "ack"
brew "xz"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "docutils"
brew "readline"
brew "python@3.11"
brew "awscli"
brew "gettext"
brew "glib"
brew "cmake"
brew "fd"
brew "harfbuzz"
brew "pango"
brew "fontforge"
brew "fzf"
brew "gd"
brew "git-delta"
brew "gnutls"
brew "gnupg"
brew "jq"
brew "less"
brew "luarocks"
brew "zlib"
brew "mysql"
brew "neovim"
brew "node"
brew "newman"
brew "php"
brew "pinentry-mac"
brew "virtualenv"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyright"
brew "ranger"
brew "ripgrep"
brew "shellcheck"
brew "sqlfluff"
brew "tcl-tk"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "jesseduffield/lazygit/lazygit"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "chromedriver"
cask "docker"
cask "dropbox"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monoid-nerd-font"
cask "iterm2"
cask "nvalt"
cask "postman"
cask "slack"
cask "visual-studio-code"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "andyyaldoo.vscode-json"
vscode "asvetliakov.vscode-neovim"
vscode "dorzey.vscode-sqlfluff"
vscode "DotJoshJohnson.xml"
vscode "esbenp.prettier-vscode"
vscode "euskadi31.json-pretty-printer"
vscode "GitHub.codespaces"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "HookyQR.beautify"
vscode "ivory-lab.jenkinsfile-support"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jim-moody.drools"
vscode "jumpinjackie.vscode-map-preview"
vscode "marlon407.code-groovy"
vscode "medo64.render-crlf"
vscode "mgesbert.indent-nested-dictionary"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "mwpb.java-prettier-formatter"
vscode "NicolasVuillamy.vscode-groovy-lint"
vscode "PascalReitermann93.vscode-yaml-sort"
vscode "phplasma.csv-to-table"
vscode "RandomFractalsInc.geo-data-viewer"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "richie5um2.vscode-sort-json"
vscode "rokoroku.vscode-theme-darcula"
vscode "SonarSource.sonarlint-vscode"
vscode "ThreadHeap.serverless-ide-vscode"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "XadillaX.viml"
