tap "configcat/tap"
tap "jesseduffield/lazygit"
tap "neovim/neovim"
tap "nikitabobko/tap"
brew "ack"
brew "shellcheck"
brew "actionlint"
brew "xz"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "ca-certificates"
brew "openssl@3"
brew "atuin"
brew "python@3.13"
brew "awscli"
brew "bat"
brew "gettext"
brew "glib"
brew "cmake"
brew "curl"
brew "harfbuzz"
brew "dependency-check"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "docutils"
brew "fd"
brew "pango"
brew "fontforge"
brew "freetds"
brew "fzf"
brew "gd"
brew "gh"
brew "git"
brew "git-delta"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "ncurses"
brew "htop"
brew "icu4c@76"
brew "jmeter"
brew "jq"
brew "lazygit"
brew "less"
brew "libpq"
brew "lua"
brew "luarocks"
brew "lynx"
brew "zlib"
brew "mysql", restart_service: :changed
brew "neovim"
brew "node"
brew "newman"
brew "perl"
brew "php"
brew "php@8.3"
brew "pinentry-mac"
brew "pkgconf"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyright"
brew "python@3.11"
brew "python@3.12"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "sqlfluff"
brew "tcl-tk"
brew "tmux"
brew "tree"
brew "vim"
brew "virtualenv"
brew "wget"
brew "yamllint"
brew "yazi"
brew "zsh"
brew "configcat/tap/configcat"
cask "1password-cli"
cask "aerospace@0.14.2"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "chromedriver"
cask "espanso"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monoid-nerd-font"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keycastr"
cask "postman"
cask "shottr"
cask "slack"
cask "visual-studio-code"
cask "zen"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "andyyaldoo.vscode-json"
vscode "asvetliakov.vscode-neovim"
vscode "docker.docker"
vscode "dorzey.vscode-sqlfluff"
vscode "dotjoshjohnson.xml"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "euskadi31.json-pretty-printer"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "hbenl.vscode-test-explorer"
vscode "ivory-lab.jenkinsfile-support"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jim-moody.drools"
vscode "jumpinjackie.vscode-map-preview"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "marlon407.code-groovy"
vscode "mechatroner.rainbow-csv"
vscode "medo64.render-crlf"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mgesbert.indent-nested-dictionary"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "mwpb.java-prettier-formatter"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "phoihos.csv-to-md-table"
vscode "phplasma.csv-to-table"
vscode "randomfractalsinc.geo-data-viewer"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "richie5um2.vscode-sort-json"
vscode "rokoroku.vscode-theme-darcula"
vscode "sonarsource.sonarlint-vscode"
vscode "threadheap.serverless-ide-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "xadillax.viml"
